In [1]:
#ORDINAL NUMBER ENCODING

In [2]:
import datetime

In [3]:
today_date=datetime.datetime.today()

In [4]:
today_date

datetime.datetime(2020, 10, 23, 23, 7, 10, 831697)

In [6]:
#List Comprehension
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [7]:
import pandas as pd
data=pd.DataFrame(days)
data.columns=['Day']

In [8]:
data.head()

                         Day
0 2020-10-23 23:07:10.831697
1 2020-10-22 23:07:10.831697
2 2020-10-21 23:07:10.831697
3 2020-10-20 23:07:10.831697
4 2020-10-19 23:07:10.831697

In [10]:
data['Day'].dt.day_name()

0        Friday
1      Thursday
2     Wednesday
3       Tuesday
4        Monday
5        Sunday
6      Saturday
7        Friday
8      Thursday
9     Wednesday
10      Tuesday
11       Monday
12       Sunday
13     Saturday
14       Friday
Name: Day, dtype: object

In [11]:
data['Day'].dt.day

0     23
1     22
2     21
3     20
4     19
5     18
6     17
7     16
8     15
9     14
10    13
11    12
12    11
13    10
14     9
Name: Day, dtype: int64

In [12]:
data['Day'].dt.year

0     2020
1     2020
2     2020
3     2020
4     2020
5     2020
6     2020
7     2020
8     2020
9     2020
10    2020
11    2020
12    2020
13    2020
14    2020
Name: Day, dtype: int64

In [13]:
data['Day'].dt.month

0     10
1     10
2     10
3     10
4     10
5     10
6     10
7     10
8     10
9     10
10    10
11    10
12    10
13    10
14    10
Name: Day, dtype: int64

In [15]:
data['Day'].dt.minute

0     7
1     7
2     7
3     7
4     7
5     7
6     7
7     7
8     7
9     7
10    7
11    7
12    7
13    7
14    7
Name: Day, dtype: int64

In [18]:
data['weekday']=data['Day'].dt.day_name()

In [19]:
data.head()

                         Day    weekday
0 2020-10-23 23:07:10.831697     Friday
1 2020-10-22 23:07:10.831697   Thursday
2 2020-10-21 23:07:10.831697  Wednesday
3 2020-10-20 23:07:10.831697    Tuesday
4 2020-10-19 23:07:10.831697     Monday

In [20]:
dictionary={'Monday':1,
           'Tuesday':2,
           'Wednesday':3,
           'Thursday':4,
           'Friday':5,
           'Saturday':6,
           'Sunday':7}

In [21]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [23]:
data['weekday_ordinal']=data['weekday'].map(dictionary)

In [24]:
data.head()

                         Day    weekday  weekday_ordinal
0 2020-10-23 23:07:10.831697     Friday                5
1 2020-10-22 23:07:10.831697   Thursday                4
2 2020-10-21 23:07:10.831697  Wednesday                3
3 2020-10-20 23:07:10.831697    Tuesday                2
4 2020-10-19 23:07:10.831697     Monday                1

In [25]:
##COUNT / FREQUENCY ENCODING
data=pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',header=None,index_col=None)
data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [26]:
columns=[1,3,5,6,7,8,9,13]

In [28]:
data[columns]

,1,3,5,6,7,8,9,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba
...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,United-States
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,United-States
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,United-States
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,United-States
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States

In [30]:
data=data[columns]

In [31]:
data.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [32]:
data.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [34]:
for features in data.columns[:]:
    print(features,":",len(data[features].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [36]:
data['Country'].value_counts().to_dict()

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' Greece': 29,
 ' France': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Trinadad&Tobago': 19,
 ' Cambodia': 19,
 ' Thailand': 18,
 ' Laos': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Honduras': 13,
 ' Hungary': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [37]:
country_map=data['Country'].value_counts().to_dict()

In [38]:
data['Country']=data['Country'].map(country_map)
data.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

In [39]:
# ###ADVANTAGES
# 1. Easy to use
# 2. Not increasing feature space

# ##DISADVANTAGES
# 1. It will provide same wt. if frquencies are same
# 2.

In [40]:
##TARGET GUIDED ORDINAL ENCODING

In [41]:
# 1. Ordering Labels according to the Target
# 2. Replace the labels by joint probability of being 1 or 0

In [42]:
import pandas as pd
df=pd.read_csv('train.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [43]:
df['Cabin'].fillna('Missing',inplace=True)

In [44]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [47]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [48]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [52]:
df.groupby(['Cabin'])['Survived'].mean().sort_values(ascending=False)

Cabin
D    0.757576
E    0.750000
B    0.744681
F    0.615385
C    0.593220
G    0.500000
A    0.466667
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [53]:
#PERSON OF A CABIN HAS PROBABILITY OF 0.46667 of Surviving

In [54]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [55]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [56]:
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [57]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}

In [59]:
ordinal_labels2 #rankings

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [60]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

In [61]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [62]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [63]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)

In [64]:
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854